package day01;

public class a_00문제 {

	public static void main(String[] args) {

		// 시작 시간:1:11
		System.out.printf("%.2f\n", (20 + 34 + 10) / 3.0);
		// 종료 시간: 1:13

		// 시작 시간1:13
		System.out.println((100 * 12) - (100 * 12) * 0.1);
		//100*12*0.9
		// 종료 시간 1:15

		// 시작 시간 1:16
		System.out.println((12 * 7) / (2 + 4));
		// 종료 시간 1:18

		// 시작 시간 1:18
		System.out.println(((11.0) / 100) * 3 + "kg");
		// 종료 시간 1:20

		// 시작 시간 1:21
		/*
		 판매된 우유 = > 16% 15% 31%
		 남은 우유 = > 69%
		 우유 1% 우유 =>345/69*100
		 */
		System.out.println((345/(100-(16 + 15)))*100);
		// 잘 모르겠습니다.

		// 시작 시간 2:08
		System.out.println((5 / 8.0 * 1056) + ((7 / 8.0 * 1056) * 0.17 + (7 / 8.0 * 1056)));
		// 종료 시간 2:16
	}

}
